
&НаКлиенте
Процедура КомандаДобавитьПриложение(Команда)
	ДобавитьПриложение();
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьПриложение(Команда)
	УдалитьПриложение();
КонецПроцедуры

&НаСервере
Процедура ДобавитьПриложение()
	
	ОписаниеОшибки = "";
		
	Структура = Новый Структура;
	Структура.Вставить("id", Строка(Новый УникальныйИдентификатор()));
	Структура.Вставить("siteName", ИмяСайта);
	Структура.Вставить("poolName", ИмяПула);
	Структура.Вставить("appName", ИмяПриложения);
	Структура.Вставить("physicalPath", Путь);
		
	Ответ = ВыполнитьКомандуPowerShell(КаталогОбработчика, ИмяФайла, "AddAppToIIS", Структура, ОписаниеОшибки);

	Если Ответ <> Неопределено Тогда 
		Если Ответ.success Тогда 
			Результат = СтрШаблон(НСтр("ru='Конвертировано в приложение %1'", "ru"), ИмяПриложения);	
		Иначе
			Результат = СтрШаблон(НСтр("ru='Ошибка добавления приложения для базы %1 на сервере %2%3%4'", "ru"), ИмяПриложения, ИмяКомпьютера(),  Символы.ПС, Ответ.error);		
		КонецЕсли;
	Иначе
		Результат = СтрШаблон(НСтр("ru='Ошибка добавления приложения для базы %1 на сервере %2%3%4'", "ru"), ИмяПриложения, ИмяКомпьютера(),  Символы.ПС, ОписаниеОшибки);	
	КонецЕсли;
	
	Сообщить(Результат);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПриложение()
	
	ОписаниеОшибки = "";
		
	Структура = Новый Структура;
	Структура.Вставить("id", Строка(Новый УникальныйИдентификатор()));
	Структура.Вставить("siteName", ИмяСайта);
	Структура.Вставить("poolName", ИмяПула);
	Структура.Вставить("appName", ИмяПриложения);
	Структура.Вставить("physicalPath", Путь);
		
	Ответ = ВыполнитьКомандуPowerShell(КаталогОбработчика, ИмяФайла, "", Структура, ОписаниеОшибки);

	Если Ответ <> Неопределено Тогда 
		Если Ответ.success Тогда 
			Результат = СтрШаблон(НСтр("ru='Конвертировано в приложение %1'", "ru"), ИмяПриложения);	
		Иначе
			Результат = СтрШаблон(НСтр("ru='Ошибка добавления приложения для базы %1 на сервере %2%3%4'", "ru"), ИмяПриложения, ИмяКомпьютера(),  Символы.ПС, Ответ.error);		
		КонецЕсли;
	Иначе
		Результат = СтрШаблон(НСтр("ru='Ошибка добавления приложения для базы %1 на сервере %2%3%4'", "ru"), ИмяПриложения, ИмяКомпьютера(),  Символы.ПС, ОписаниеОшибки);	
	КонецЕсли;
	
	Сообщить(Результат);
	
КонецПроцедуры


// Выполнение команды Power shell 
//
// Параметры:
//   КаталогОбработчика - Строка - каталог проекта
//   ИмяФайла - Строка - имя файла
//   ИмяКоманды - Строка - имя функции в файле
//   Параметры - Структура - параметры функции
//   ОписаниеОшибки - Строка - текст ошибки
//
// Возвращаемое значение:
//   Ответ - Строка - результат выполнения
//
&НаСервере
Функция ВыполнитьКомандуPowerShell(КаталогОбработчика, ИмяФайла, ИмяКоманды, Параметры, ОписаниеОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ответ = Неопределено;
	
	Попытка
		
		ПутьФайлаЗаписи = СтрШаблон(НСтр("ru='%1\data.json'", "ru"), КаталогОбработчика);
		
		// Проверка файла записи ответов
		Файл = Новый Файл(ПутьФайлаЗаписи); 
		Если НЕ Файл.Существует() Тогда 
			Струтура = Новый Структура;
			Струтура.Вставить("data", Новый Массив);
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.ОткрытьФайл(ПутьФайлаЗаписи);
			ЗаписатьJSON(ЗаписьJSON, Струтура);
			ЗаписьJSON.Закрыть();
		КонецЕсли;
		
		// Добавление id записи в файл
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.ОткрытьФайл(ПутьФайлаЗаписи);
		Данные = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		НоваяЗапись = Новый Структура;
		НоваяЗапись.Вставить("id", Параметры.id);
		НоваяЗапись.Вставить("success", Ложь);
		НоваяЗапись.Вставить("result", "");
		НоваяЗапись.Вставить("error", "");
		Данные.data.Добавить(НоваяЗапись);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ОткрытьФайл(ПутьФайлаЗаписи);
		ЗаписатьJSON(ЗаписьJSON, Данные);
		ЗаписьJSON.Закрыть();
		
		СтрокаПараметры = "";
		Для Каждого ТекущийПараметр Из Параметры Цикл
			СтрокаПараметры = СтрШаблон(НСтр("ru='%1 -%2 ""%3""'", "ru"), СтрокаПараметры, ТекущийПараметр.Ключ, ТекущийПараметр.Значение);		
		КонецЦикла;	
		
		СтрокаКоманды = СтрШаблон(НСтр("ru='powershell.exe -executionpolicy ByPass "". %1\%2; %3 %4"" '", "ru"), КаталогОбработчика, ИмяФайла, ИмяКоманды, СтрокаПараметры);
		
		ЗапуститьПриложение(СтрокаКоманды, КаталогОбработчика, Истина);
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.ОткрытьФайл(ПутьФайлаЗаписи);
		Данные = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Для Каждого ТекущаяЗапись Из Данные.data Цикл
			Если ТекущаяЗапись.id = Параметры.id Тогда 
				Ответ = ТекущаяЗапись;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
			
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();	
	КонецПопытки;
	
	Если Ответ = Неопределено И НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда 
		СтрШаблон(НСтр("ru='Не найден результат по id %1'", "ru"), Параметры.id);	
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
		
КонецФункции
